[
  {
    "bookId": 1,
    "bookName": "Atomic Habits",
    "author": "James Clear",
    "image": "/images/book-1.png",
    "review": "This book explores how small, consistent habits can lead to significant personal and professional growth. James Clear explains the science behind habit formation, showing how tiny improvements, when accumulated, create remarkable results. The book introduces concepts like the habit loop, identity-based habits, and the 1% rule. By focusing on systems rather than goals, it teaches practical strategies to build good habits, break bad ones, and make success inevitable. With real-life examples and actionable steps, it’s a must-read for anyone looking to improve their life through small yet powerful behavioral changes.",
    "totalPages": 320,
    "rating": 4.8,
    "category": "Self-Help",
    "tags1": ["Productivity"],
    "tags2": ["Psychology"],
    "publisher": "Avery",
    "yearOfPublishing": 2018
  },
  {
    "bookId": 2,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "/images/book-2.png",
    "review": "This novel follows the journey of Santiago, a young shepherd who dreams of discovering a hidden treasure in Egypt. Along his way, he meets several characters who teach him about destiny, perseverance, and self-discovery. The book emphasizes the importance of listening to one's heart and pursuing dreams despite obstacles. It blends adventure, spirituality, and philosophy to deliver an inspiring message about the power of personal legend. Coelho’s poetic writing and timeless wisdom make this book a masterpiece that resonates with readers searching for purpose and fulfillment in life.",
    "totalPages": 208,
    "rating": 4.7,
    "category": "Fiction",
    "tags1": ["Adventure"],
    "tags2": ["Philosophy"],
    "publisher": "HarperOne",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 3,
    "bookName": "Thinking, Fast and Slow",
    "author": "Daniel Kahneman",
    "image": "/images/book-3.png",
    "review": "This book delves into the two systems of thinking: System 1, which is fast, intuitive, and emotional, and System 2, which is slow, rational, and analytical. Nobel laureate Daniel Kahneman explains how these two systems shape our decisions and judgments, often leading to cognitive biases. He discusses concepts like prospect theory, overconfidence, and decision-making errors that affect various aspects of life, from business to personal finance. The book provides a fascinating insight into human psychology and offers strategies to improve reasoning and avoid common thinking pitfalls.",
    "totalPages": 499,
    "rating": 4.6,
    "category": "Psychology",
    "tags1": ["Behavioral Science"],
    "tags2": ["Cognitive"],
    "publisher": "Farrar, Straus and Giroux",
    "yearOfPublishing": 2011
  },
  {
    "bookId": 4,
    "bookName": "Rich Dad Poor Dad",
    "author": "Robert Kiyosaki",
    "image": "/images/book-4.png",
    "review": "In this book, Robert Kiyosaki contrasts the financial mindsets of his two 'dads'—his educated but financially struggling biological father (Poor Dad) and his friend's wealthy, business-savvy father (Rich Dad). The book highlights key financial lessons such as the importance of financial education, investing, and building passive income. Kiyosaki emphasizes that wealth is not about how much money you make but how well you manage and invest it. Through engaging storytelling, the book challenges conventional beliefs about money and encourages readers to think differently about financial success.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Finance",
    "tags1": ["Investment"],
    "tags2": ["Wealth"],
    "publisher": "Plata Publishing",
    "yearOfPublishing": 1997
  },
  {
    "bookId": 5,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "/images/book-5.png",
    "review": "This dystopian novel presents a chilling vision of a totalitarian regime where government surveillance, propaganda, and thought control dominate every aspect of life. The protagonist, Winston Smith, struggles against an oppressive system that seeks to eliminate independent thinking. Orwell’s depiction of a world ruled by 'Big Brother' serves as a warning about the dangers of authoritarianism and the loss of personal freedom. The book remains highly relevant, addressing themes of political manipulation, censorship, and societal control. It’s a powerful and thought-provoking read that continues to influence discussions about democracy and human rights.",
    "totalPages": 328,
    "rating": 4.9,
    "category": "Dystopian",
    "tags1": ["Politics"],
    "tags2": ["Society"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 6,
    "bookName": "The Psychology of Money",
    "author": "Morgan Housel",
    "image": "/images/book-6.png",
    "review": "This book explores how human psychology influences financial decisions. Morgan Housel argues that financial success is less about intelligence and more about behavior, mindset, and emotional discipline. Through engaging stories and simple yet profound insights, he explains how people perceive risk, wealth, and financial security differently. The book highlights the importance of long-term thinking, avoiding greed, and making sound financial choices. It’s an eye-opening read for anyone looking to develop a healthier relationship with money and build wealth sustainably.",
    "totalPages": 256,
    "rating": 4.8,
    "category": "Finance",
    "tags1": ["Money"],
    "tags2": ["Mindset"],
    "publisher": "Harriman House",
    "yearOfPublishing": 2020
  }
]
